class Compressor:
    """Клас, що моделює роботу компресора кондиціонера.
    Компресор може бути увімкнений або вимкнений."""
    
    def __init__(self):
        """Конструктор за замовчуванням. Створює компресор у вимкненому стані."""
        self.running = False
    
    def start(self):
        """Увімкнення компресора. Змінює стан компресора на "увімкнено"."""
        self.running = True
    
    def stop(self):
        """Вимкнення компресора. Змінює стан компресора на "вимкнено"."""
        self.running = False
    
    def is_running(self):
        """Перевіряє, чи працює компресор.
        
        Повертає:
            bool: True, якщо компресор увімкнено, False, якщо вимкнено.
        """
        return self.running
