class Filter:
    """Клас Filter моделює фільтр кондиціонера.
    Фільтр може бути чистим або забрудненим."""
    
    def __init__(self, clean=True):
        """Конструктор, який дозволяє встановити стан фільтра (чистий або забруднений).
        
        Аргументи:
            clean (bool): стан фільтра: True для чистого фільтра, False для забрудненого
        """
        self.clean = clean
    
    def is_clean(self):
        """Перевіряє, чи є фільтр чистим.
        
        Повертає:
            bool: True, якщо фільтр чистий, False, якщо він забруднений
        """
        return self.clean
    
    def clean_filter(self):
        """Очищує фільтр, встановлюючи його стан як чистий."""
        self.clean = True
    
    def soil(self):
        """Забруднює фільтр, встановлюючи його стан як забруднений."""
        self.clean = False
